In [2]:
import pandas as pd

In [3]:
dataset = {
    'Product': ['Laptop', 'Smartphone', 'Tablet', 'Smartwatch', 'Headphones'],
    'Price (USD)': [1200, 800, 500, 300, 200],
    'Category': ['Electronics', 'Electronics', 'Electronics', 'Electronics', 'Electronics']
}

In [6]:
df = pd.DataFrame(dataset)
df

      Product  Price (USD)     Category
0      Laptop         1200  Electronics
1  Smartphone          800  Electronics
2      Tablet          500  Electronics
3  Smartwatch          300  Electronics
4  Headphones          200  Electronics

In [7]:
df.head(3)

      Product  Price (USD)     Category
0      Laptop         1200  Electronics
1  Smartphone          800  Electronics
2      Tablet          500  Electronics

In [8]:
df.tail(3)

      Product  Price (USD)     Category
2      Tablet          500  Electronics
3  Smartwatch          300  Electronics
4  Headphones          200  Electronics

In [9]:
df.describe()

       Price (USD)
count      5.00000
mean     600.00000
std      406.20192
min      200.00000
25%      300.00000
50%      500.00000
75%      800.00000
max     1200.00000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Product      5 non-null      object
 1   Price (USD)  5 non-null      int64
 2   Category     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [13]:
shape = df.shape
shape

(5, 3)

In [14]:
df.isnull()

   Product  Price (USD)  Category
0    False        False     False
1    False        False     False
2    False        False     False
3    False        False     False
4    False        False     False

In [15]:
df['Category'].unique()

array(['Electronics'], dtype=object)

In [16]:
df['Category'].nunique()

1

In [17]:
df['Product'].nunique()

5

In [18]:
df['Product'].value_counts()

Laptop        1
Smartphone    1
Tablet        1
Smartwatch    1
Headphones    1
Name: Product, dtype: int64

In [20]:
sum(df['Price (USD)'].between(200,1000))

4

In [ ]:
df['len_product'] = df['Product']